{
    "tags": [
        {
            "name": "hexID",
            "value": "FZP1X5LL"
        },
        {
            "name": "oompType",
            "value": "FOOTPRINT"
        },
        {
            "name": "oompSize",
            "value": "eagle"
        },
        {
            "name": "oompColor",
            "value": "Pimoroni-Eagle-Library"
        },
        {
            "name": "oompDesc",
            "value": "pimoroni"
        },
        {
            "name": "oompIndex",
            "value": "1X05_LOCK_LONGPADS"
        },
        {
            "name": "oompName",
            "value": "Pimoroni-Eagle-Library/pimoroni/1X05_LOCK_LONGPADS"
        },
        {
            "name": "description",
            "value": "This footprint was designed to help hold the alignment of a through-hole component (i.e.  6-pin header) while soldering it into place.  \nYou may notice that each hole has been shifted either up or down by 0.005 of an inch from it's more standard position (which is a perfectly straight line).  \nThis slight alteration caused the pins (the squares in the middle) to touch the edges of the holes.  Because they are alternating, it causes a &quot;brace&quot; \nto hold the component in place.  0.005 has proven to be the perfect amount of &quot;off-center&quot; position when using our standard breakaway headers.\nAlthough looks a little odd when you look at the bare footprint, once you have a header in there, the alteration is very hard to notice.  Also,\nif you push a header all the way into place, it is covered up entirely on the bottom side.  This idea of altering the position of holes to aid alignment \nwill be further integrated into the Sparkfun Library for other footprints.  It can help hold any component with 3 or more connection pins."
        },
        {
            "name": "oompID",
            "value": "FOOTPRINT-eagle-Pimoroni-Eagle-Library-pimoroni-1X05_LOCK_LONGPADS"
        },
        {
            "name": "oompID",
            "value": "FOOTPRINT-eagle-Pimoroni-Eagle-Library-pimoroni-1X05_LOCK_LONGPADS"
        },
        {
            "name": "name",
            "value": ""
        }
    ]
}